In [15]:
import pandas as pd
import csv
import datetime as dt
from sqlalchemy import create_engine
from config import username, password

In [16]:
meteorites = pd.read_csv('Meteorite_Landings.csv')

In [17]:
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/meteorites_db')

In [3]:
meteorites.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.16667, -64.95)"

In [4]:
meteorites_df = meteorites.dropna()

In [19]:
meteorites_df.count()

name           38115
id             38115
nametype       38115
recclass       38115
mass (g)       38115
fall           38115
year           38115
reclat         38115
reclong        38115
GeoLocation    38115
dtype: int64

In [5]:
meteorites.columns

Index(['name', 'id', 'nametype', 'recclass', 'mass (g)', 'fall', 'year',
       'reclat', 'reclong', 'GeoLocation'],
      dtype='object')

In [21]:
df = meteorites_df.drop(columns=["GeoLocation","nametype"])

In [22]:
df

,name,id,recclass,mass (g),fall,year,reclat,reclong
0,Aachen,1,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333
1,Aarhus,2,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333
2,Abee,6,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000
3,Acapulco,10,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000
4,Achiras,370,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000
...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Eucrite,172.0,Found,01/01/1990 12:00:00 AM,29.03700,17.01850
45712,Zinder,30409,"Pallasite, ungrouped",46.0,Found,01/01/1999 12:00:00 AM,13.78333,8.96667
45713,Zlin,30410,H4,3.3,Found,01/01/1939 12:00:00 AM,49.25000,17.66667
45714,Zubkovsky,31357,L6,2167.0,Found,01/01/2003 12:00:00 AM,49.78917,41.50460
45715,Zulu Queen,30414,L3.7,200.0,Found,01/01/1976 12:00:00 AM,33.98333,-115.68333

In [23]:
df.count()

name        38115
id          38115
recclass    38115
mass (g)    38115
fall        38115
year        38115
reclat      38115
reclong     38115
dtype: int64

In [37]:
df2 = df.loc[(df.reclat != 0) | (df.reclong != 0)].copy()

In [38]:
df2.count()

name        31929
id          31929
recclass    31929
mass (g)    31929
fall        31929
year        31929
reclat      31929
reclong     31929
dtype: int64

In [39]:
df2.head()

,name,id,recclass,mass (g),fall,year,reclat,reclong
0,Aachen,1,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333
1,Aarhus,2,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333
2,Abee,6,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000
3,Acapulco,10,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000
4,Achiras,370,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000

In [40]:
# Convert Year to YYYY
df2['year'] = df2['year'].str[6:10].astype(int)
print(df2['year'])

0        1880
1        1951
2        1952
3        1976
4        1902
         ...
45711    1990
45712    1999
45713    1939
45714    2003
45715    1976
Name: year, Length: 31929, dtype: int32

In [41]:
# Change Col Name
df2 = df2.rename(columns = {'mass (g)':'mass'})
df2.columns

Index(['name', 'id', 'recclass', 'mass', 'fall', 'year', 'reclat', 'reclong'], dtype='object')

In [43]:
df2.to_sql('meteorites', con=engine)